; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld3)
(:domain blocksworld)
(:objects
    green_block - block 
    arm - robot 
    yellow_block - block 
    purple_block - block 
    pink_block - block 
    red_block - block 
)

(:init
    ( clear green_block )
    ( clear pink_block )
    ( clear purple_block )
    ( clear red_block )
    ( clear yellow_block )
    ( handempty arm )
    ( ontable green_block )
    ( ontable pink_block )
    ( ontable purple_block )
    ( ontable red_block )
    ( ontable yellow_block )
)

(:goal (and (on yellow_block green_block) (on green_block pink_block) (on red_block purple_block)))
)

; plan
1. (pick_up red_block arm)
   deleted: (ontable red_block) (clear red_block) (handempty arm)
   added: (handfull arm) (holding red_block)
   goals met: 0 of 3
2. (stack red_block purple_block arm)
   deleted: (holding red_block) (clear purple_block) (handfull arm)
   added: (clear red_block) (handempty arm) (on red_block purple_block)
   goals met: 1 of 3
3. (pick_up green_block arm)
   deleted: (ontable green_block) (clear green_block) (handempty arm)
   added: (handfull arm) (holding green_block)
   goals met: 1 of 3
4. (stack green_block pink_block arm)
   deleted: (holding green_block) (clear pink_block) (handfull arm)
   added: (clear green_block) (handempty arm) (on green_block pink_block)
   goals met: 2 of 3
5. (pick_up yellow_block arm)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty arm)
   added: (handfull arm) (holding yellow_block)
   goals met: 2 of 3
6. (stack yellow_block green_block arm)
   deleted: (holding yellow_block) (clear green_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block green_block)
   goals met: 3 of 3
